Revit 2027 API
RebarShapeTerminationsData.TerminationOrientationAtStart Property
Identifies the orientation of the termination (e.g. hook, crank) at start.
The default value is Left.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarTerminationOrientation TerminationOrientationAtStart { get; set; }
Public Property TerminationOrientationAtStart As RebarTerminationOrientation
	Get
	Set
public:
property RebarTerminationOrientation TerminationOrientationAtStart {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
member TerminationOrientationAtStart : RebarTerminationOrientation with get, set
Property Value
RebarTerminationOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarShapeTerminationsData Class
Autodesk.Revit.DB.Structure Namespace